In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv("data/job_postings.csv")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15886 entries, 0 to 15885
Data columns (total 27 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   job_id                      15886 non-null  int64
 1   company_id                  15520 non-null  float64
 2   title                       15886 non-null  object
 3   description                 15885 non-null  object
 4   max_salary                  5521 non-null   float64
 5   med_salary                  981 non-null    float64
 6   min_salary                  5521 non-null   float64
 7   pay_period                  6502 non-null   object
 8   formatted_work_type         15886 non-null  object
 9   location                    15886 non-null  object
 10  applies                     8700 non-null   float64
 11  original_listed_time        15886 non-null  int64
 12  remote_allowed              2340 non-null   float64
 13  views                       13123 non-null  float64
 14  job_posting_url             15886 non-null  object
 15  application_url             9795 non-null   object
 16  application_type            15886 non-null  object
 17  expiry                      15886 non-null  int64
 18  closed_time                 928 non-null    float64
 19  formatted_experience_level  10984 non-null  object
 20  skills_desc                 144 non-null    object
 21  listed_time                 15886 non-null  int64
 22  posting_domain              9044 non-null   object
 23  sponsored                   15886 non-null  int64
 24  work_type                   15886 non-null  object
 25  currency                    6502 non-null   object
 26  compensation_type           6502 non-null   object
dtypes: float64(8), int64(5), object(14)
memory usage: 3.3+ MB

In [9]:
df.columns

Index(['job_id', 'company_id', 'title', 'description', 'max_salary',
       'med_salary', 'min_salary', 'pay_period', 'formatted_work_type',
       'location', 'applies', 'original_listed_time', 'remote_allowed',
       'views', 'job_posting_url', 'application_url', 'application_type',
       'expiry', 'closed_time', 'formatted_experience_level', 'skills_desc',
       'listed_time', 'posting_domain', 'sponsored', 'work_type', 'currency',
       'compensation_type'],
      dtype='object')

In [17]:
df.head()

,job_id,company_id,title,description,max_salary,med_salary,min_salary,pay_period,formatted_work_type,location,...,expiry,closed_time,formatted_experience_level,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type
0,85008768,NaN,Licensed Insurance Agent,While many industries were hurt by the last fe...,52000.0,NaN,45760.0,YEARLY,Full-time,"Chico, CA",...,1708301126000,NaN,NaN,NaN,1692749193000,NaN,1,FULL_TIME,USD,BASE_SALARY
1,133114754,77766802.0,Sales Manager,Are you a dynamic and creative marketing profe...,NaN,NaN,NaN,NaN,Full-time,"Santa Clarita, CA",...,1695426553000,NaN,NaN,NaN,1692834553000,NaN,0,FULL_TIME,NaN,NaN
2,133196985,1089558.0,Model Risk Auditor,Join Us as a Model Risk Auditor – Showcase You...,NaN,NaN,NaN,NaN,Contract,"New York, NY",...,1695321872000,NaN,NaN,NaN,1692729872000,NaN,0,CONTRACT,NaN,NaN
3,381055942,96654609.0,Business Manager,Business ManagerFirst Baptist Church ForneyFor...,NaN,NaN,NaN,NaN,Full-time,"Forney, TX",...,1695424007000,NaN,NaN,NaN,1692832007000,NaN,0,FULL_TIME,NaN,NaN
4,529257371,1244539.0,NY Studio Assistant,YOU COULD BE ONE OF THE MAGIC MAKERS\nKen Fulk...,NaN,NaN,NaN,NaN,Full-time,"New York, NY",...,1708419602000,NaN,NaN,NaN,1692867714000,NaN,1,FULL_TIME,NaN,NaN

In [3]:
Job_Title = df["title"]

In [4]:
Minimum_Salary = df["min_salary"]

In [5]:
Job_Location = df["location"]

In [5]:
Job_Location = df["location"]

In [7]:
df[["title", "min_salary", "location"]]

                                       title  min_salary           location
0                   Licensed Insurance Agent     45760.0          Chico, CA
1                              Sales Manager         NaN  Santa Clarita, CA
2                         Model Risk Auditor         NaN       New York, NY
3                           Business Manager         NaN         Forney, TX
4                        NY Studio Assistant         NaN       New York, NY
...                                      ...         ...                ...
15881                  Sanitation Technician         NaN  West Columbia, SC
15882                         Unit Secretary         NaN        Teaneck, NJ
15883                Radiology Aide, Perdiem         NaN        Teaneck, NJ
15884                            MRI Manager    110000.0       New York, NY
15885  Area Director of Business Development         NaN      Vicksburg, MS

[15886 rows x 3 columns]

In [8]:
df2 = df[["title", "min_salary", "location"]]

In [9]:
df2

                                       title  min_salary           location
0                   Licensed Insurance Agent     45760.0          Chico, CA
1                              Sales Manager         NaN  Santa Clarita, CA
2                         Model Risk Auditor         NaN       New York, NY
3                           Business Manager         NaN         Forney, TX
4                        NY Studio Assistant         NaN       New York, NY
...                                      ...         ...                ...
15881                  Sanitation Technician         NaN  West Columbia, SC
15882                         Unit Secretary         NaN        Teaneck, NJ
15883                Radiology Aide, Perdiem         NaN        Teaneck, NJ
15884                            MRI Manager    110000.0       New York, NY
15885  Area Director of Business Development         NaN      Vicksburg, MS

[15886 rows x 3 columns]

In [46]:
df["title"] = "Sales Associate"

In [47]:
df3 = df

In [48]:
df3

,job_id,company_id,title,description,max_salary,med_salary,min_salary,pay_period,formatted_work_type,location,...,expiry,closed_time,formatted_experience_level,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type
0,85008768,NaN,Sales Associate,While many industries were hurt by the last fe...,52000.0,NaN,45760.0,YEARLY,Full-time,"Chico, CA",...,1708301126000,NaN,NaN,NaN,1692749193000,NaN,1,FULL_TIME,USD,BASE_SALARY
1,133114754,77766802.0,Sales Associate,Are you a dynamic and creative marketing profe...,NaN,NaN,NaN,NaN,Full-time,"Santa Clarita, CA",...,1695426553000,NaN,NaN,NaN,1692834553000,NaN,0,FULL_TIME,NaN,NaN
2,133196985,1089558.0,Sales Associate,Join Us as a Model Risk Auditor – Showcase You...,NaN,NaN,NaN,NaN,Contract,"New York, NY",...,1695321872000,NaN,NaN,NaN,1692729872000,NaN,0,CONTRACT,NaN,NaN
3,381055942,96654609.0,Sales Associate,Business ManagerFirst Baptist Church ForneyFor...,NaN,NaN,NaN,NaN,Full-time,"Forney, TX",...,1695424007000,NaN,NaN,NaN,1692832007000,NaN,0,FULL_TIME,NaN,NaN
4,529257371,1244539.0,Sales Associate,YOU COULD BE ONE OF THE MAGIC MAKERS\nKen Fulk...,NaN,NaN,NaN,NaN,Full-time,"New York, NY",...,1708419602000,NaN,NaN,NaN,1692867714000,NaN,1,FULL_TIME,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15881,3701373516,74718032.0,Sales Associate,"Location:\n\nWest Columbia, SC, US, 29172\n\n2...",NaN,NaN,NaN,NaN,Part-time,"West Columbia, SC",...,1695336734000,NaN,Entry level,NaN,1692744734000,aspirebakeriescareers.com,0,PART_TIME,NaN,NaN
15882,3701373522,38897.0,Sales Associate,Job Title: Unit Secretary\nDepartment: Nursing...,NaN,NaN,NaN,NaN,Full-time,"Teaneck, NJ",...,1695336368000,NaN,Entry level,NaN,1692744368000,recruiting.ultipro.com,0,FULL_TIME,NaN,NaN
15883,3701373523,38897.0,Sales Associate,"Job Title: Radiology Aide, Perdiem\nDepartment...",NaN,NaN,NaN,NaN,Part-time,"Teaneck, NJ",...,1695336368000,NaN,Entry level,NaN,1692744368000,recruiting.ultipro.com,0,PART_TIME,NaN,NaN
15884,3701373524,2623.0,Sales Associate,Grade 105\nJob Type: Officer of Administration...,135000.0,NaN,110000.0,YEARLY,Full-time,"New York, NY",...,1695336071000,NaN,Mid-Senior level,NaN,1692744071000,opportunities.columbia.edu,0,FULL_TIME,USD,BASE_SALARY
15885,3701373527,84659.0,Sales Associate,Nexion Health Management affiliates operate 56...,NaN,NaN,NaN,NaN,Full-time,"Vicksburg, MS",...,1695335131000,NaN,NaN,NaN,1692743131000,NaN,0,FULL_TIME,NaN,NaN

In [49]:
df3.ndim

2

In [50]:
df3.size

428922

In [51]:
df3.shape

(15886, 27)

In [52]:
df3.isnull()

,job_id,company_id,title,description,max_salary,med_salary,min_salary,pay_period,formatted_work_type,location,...,expiry,closed_time,formatted_experience_level,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type
0,False,True,False,False,False,True,False,False,False,False,...,False,True,True,True,False,True,False,False,False,False
1,False,False,False,False,True,True,True,True,False,False,...,False,True,True,True,False,True,False,False,True,True
2,False,False,False,False,True,True,True,True,False,False,...,False,True,True,True,False,True,False,False,True,True
3,False,False,False,False,True,True,True,True,False,False,...,False,True,True,True,False,True,False,False,True,True
4,False,False,False,False,True,True,True,True,False,False,...,False,True,True,True,False,True,False,False,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15881,False,False,False,False,True,True,True,True,False,False,...,False,True,False,True,False,False,False,False,True,True
15882,False,False,False,False,True,True,True,True,False,False,...,False,True,False,True,False,False,False,False,True,True
15883,False,False,False,False,True,True,True,True,False,False,...,False,True,False,True,False,False,False,False,True,True
15884,False,False,False,False,False,True,False,False,False,False,...,False,True,False,True,False,False,False,False,False,False
15885,False,False,False,False,True,True,True,True,False,False,...,False,True,True,True,False,True,False,False,True,True

In [54]:
df3.isnull().sum()

job_id                            0
company_id                      366
title                             0
description                       1
max_salary                    10365
med_salary                    14905
min_salary                    10365
pay_period                     9384
formatted_work_type               0
location                          0
applies                        7186
original_listed_time              0
remote_allowed                13546
views                          2763
job_posting_url                   0
application_url                6091
application_type                  0
expiry                            0
closed_time                   14958
formatted_experience_level     4902
skills_desc                   15742
listed_time                       0
posting_domain                 6842
sponsored                         0
work_type                         0
currency                       9384
compensation_type              9384
dtype: int64

In [55]:
df3.to_markdown

<bound method DataFrame.to_markdown of            job_id  company_id            title  \
0        85008768         NaN  Sales Associate
1       133114754  77766802.0  Sales Associate
2       133196985   1089558.0  Sales Associate
3       381055942  96654609.0  Sales Associate
4       529257371   1244539.0  Sales Associate
...           ...         ...              ...
15881  3701373516  74718032.0  Sales Associate
15882  3701373522     38897.0  Sales Associate
15883  3701373523     38897.0  Sales Associate
15884  3701373524      2623.0  Sales Associate
15885  3701373527     84659.0  Sales Associate

                                             description  max_salary  \
0      While many industries were hurt by the last fe...     52000.0
1      Are you a dynamic and creative marketing profe...         NaN
2      Join Us as a Model Risk Auditor – Showcase You...         NaN
3      Business ManagerFirst Baptist Church ForneyFor...         NaN
4      YOU COULD BE ONE OF THE MAGIC MAKERS\nKen Fulk...         NaN
...                                                  ...         ...
15881  Location:\n\nWest Columbia, SC, US, 29172\n\n2...         NaN
15882  Job Title: Unit Secretary\nDepartment: Nursing...         NaN
15883  Job Title: Radiology Aide, Perdiem\nDepartment...         NaN
15884  Grade 105\nJob Type: Officer of Administration...    135000.0
15885  Nexion Health Management affiliates operate 56...         NaN

       med_salary  min_salary pay_period formatted_work_type  \
0             NaN     45760.0     YEARLY           Full-time
1             NaN         NaN        NaN           Full-time
2             NaN         NaN        NaN            Contract
3             NaN         NaN        NaN           Full-time
4             NaN         NaN        NaN           Full-time
...           ...         ...        ...                 ...
15881         NaN         NaN        NaN           Part-time
15882         NaN         NaN        NaN           Full-time
15883         NaN         NaN        NaN           Part-time
15884         NaN    110000.0     YEARLY           Full-time
15885         NaN         NaN        NaN           Full-time

                location  ...         expiry  closed_time  \
0              Chico, CA  ...  1708301126000          NaN
1      Santa Clarita, CA  ...  1695426553000          NaN
2           New York, NY  ...  1695321872000          NaN
3             Forney, TX  ...  1695424007000          NaN
4           New York, NY  ...  1708419602000          NaN
...                  ...  ...            ...          ...
15881  West Columbia, SC  ...  1695336734000          NaN
15882        Teaneck, NJ  ...  1695336368000          NaN
15883        Teaneck, NJ  ...  1695336368000          NaN
15884       New York, NY  ...  1695336071000          NaN
15885      Vicksburg, MS  ...  1695335131000          NaN

       formatted_experience_level  skills_desc    listed_time  \
0                             NaN          NaN  1692749193000
1                             NaN          NaN  1692834553000
2                             NaN          NaN  1692729872000
3                             NaN          NaN  1692832007000
4                             NaN          NaN  1692867714000
...                           ...          ...            ...
15881                 Entry level          NaN  1692744734000
15882                 Entry level          NaN  1692744368000
15883                 Entry level          NaN  1692744368000
15884            Mid-Senior level          NaN  1692744071000
15885                         NaN          NaN  1692743131000

                   posting_domain sponsored  work_type  currency  \
0                             NaN         1  FULL_TIME       USD
1                             NaN         0  FULL_TIME       NaN
2                             NaN         0   CONTRACT       NaN
3                             NaN         0  FULL_TIME       NaN
4                             NaN         1  FULL_TIME       NaN
...                           ...       ...        ...       ...
15881   aspirebakeriescareers.com         0  PART_TIME       NaN
15882      recruiting.ultipro.com         0  FULL_TIME       NaN
15883      recruiting.ultipro.com         0  PART_TIME       NaN
15884  opportunities.columbia.edu         0  FULL_TIME       USD
15885                         NaN         0  FULL_TIME       NaN

      compensation_type
0           BASE_SALARY
1                   NaN
2                   NaN
3                   NaN
4                   NaN
...                 ...
15881               NaN
15882               NaN
15883               NaN
15884       BASE_SALARY
15885               NaN

[15886 rows x 27 columns]>

In [56]:
df3.dropna()

Empty DataFrame
Columns: [job_id, company_id, title, description, max_salary, med_salary, min_salary, pay_period, formatted_work_type, location, applies, original_listed_time, remote_allowed, views, job_posting_url, application_url, application_type, expiry, closed_time, formatted_experience_level, skills_desc, listed_time, posting_domain, sponsored, work_type, currency, compensation_type]
Index: []

[0 rows x 27 columns]